[{"question":"If you could be any vegetable, what vegetable would you be?"},{"question":"If you joined the circus, which job would you be doing?"},{"question":"What's your favorite shape?"},{"question":"What planet are you from?"},{"question":"Are the voices in my head bothering you?"},{"question":"What are your thoughts on public restrooms?"},{"question":"Would you rather have a pet unicorn or be a unicorn?"},{"question":"Would you rather be a giant ant or a tiny hippo?"},{"question":"Would you rather lick someone else's armpit or have someone else lick your armpit?"},{"question":"Would you rather be a gummy bear or a gummy worm?"},{"question":"Do you believe in zombies?"},{"question":"Have you ever spit in someone else's food?"},{"question":"Can you lick your own elbow?"},{"question":"How do you think the world is going to end?"},{"question":"How would you plan your ideal funeral?"},{"question":"If I wasn't married, would you marry me?"},{"question":"Do you think I have bad breath?"},{"question":"What's your least favorite thing about me?"},{"question":"Where did you grow up?"},{"question":"Do you have any pets?"},{"question":"Do you have any siblings?"},{"question":"Do you know what your your name means?"},{"question":"What type of phone do you have?"},{"question":"What did you do this past weekend?"},{"question":"What are your plans for this weekend?"},{"question":"What do you like to do in your spare time?"},{"question":"What is the first thing you do when you wake up?"},{"question":"What is the last thing you do before you go to sleep?"},{"question":"What was the last thing you purchased?"},{"question":"What is your favorite holiday?"},{"question":"What is your favorite day of the week?"},{"question":"If you could meet anyone in history, who would it be?"},{"question":"What do you like to do to relax?"},{"question":"Are you a saver or a spender?"},{"question":"Do you play any instruments?"},{"question":"What was your favorite children's book?"},{"question":"What is your first childhood memory?"},{"question":"What type of kid were you (e.g. spoiled, rebellious, well-behaved, quiet, obnoxious...)?"},{"question":"What is one thing you miss about being a kid?"},{"question":"What did you want to grow up to be when you were younger?"},{"question":"Where did (do) you go to school?"},{"question":"What was (is) your favorite subject?"},{"question":"What was (is) your least favorite subject?"},{"question":"What's the first thing you do after school/work?"},{"question":"Were you the class clown or teacher's pet?"},{"question":"What do you do for a living?"},{"question":"What is your dream job?"},{"question":"If you had $10 million, would you still be working/going to school?"},{"question":"What was your least favorite job that you've ever had?"},{"question":"What is something that you have gotten in trouble for at school/work?"},{"question":"Relationship Questions"},{"question":"What is the first think you notice about a guy or girl?"},{"question":"Have you ever been in love?"},{"question":"Do you believe in soul mates?"},{"question":"What are your turn offs?"},{"question":"Do you believe in love at first sight?"},{"question":"Do you prefer short hair or long hair on a guy/girl?"},{"question":"What do you look for in a guy/girl?"},{"question":"Who was the last person you called?"},{"question":"Would you rather be rich and never find true love or be poor and find true love?"},{"question":"How often do you exercise?"},{"question":"Do you play any sports?"},{"question":"Where was the last place you went on vacation?"},{"question":"Where do you plan on going for your next vacation?"},{"question":"If you could live anywhere in the world, where would it be?"},{"question":"What countries have you traveled to?"},{"question":"What was your worst vacation experience?"},{"question":"What is your favorite drink?"},{"question":"What is your favorite food?"},{"question":"What is your favorite meal of the day?"},{"question":"Are there any foods that you dislike or will not eat?"},{"question":"Are there any foods that you would like to try?"},{"question":"What is your favorite restaurant?"},{"question":"What is your favorite pizza topping?"},{"question":"What is your favorite ice cream flavor?"},{"question":"What did you have for dinner last night?"},{"question":"What is the signature dish that you cook?"},{"question":"What is your favorite movie of all time?"},{"question":"What was the worst movie you've ever seen?"},{"question":"What is your favorite TV show?"},{"question":"What was the last movie you've seen?"},{"question":"What type of music do you like to listen to?"},{"question":"Who is your favorite music artist?"},{"question":"What was the last book you read?"},{"question":"Who do you look up to?"},{"question":"Where do you see yourself 5 years from now?"},{"question":"What are you scared of?"},{"question":"What is the best piece of advice you've received?"},{"question":"What do your parents do for a living?"},{"question":"What is your biggest regret?"},{"question":"What is your most embarrassing moment?"},{"question":"What is the craziest thing you've ever done?"},{"question":"What are some of your short-term goals?"},{"question":"What are some of your long-term goals?"},{"question":"Do you sleep with a stuffed animal?"},{"question":"Tell me about your first car."},{"question":"Do you drink coffee or tea?"},{"question":"If you could have any super power, what would it be?"},{"question":"If you were stranded on a deserted island and you could have only 1 item, what would it be?"},{"question":"Do you believe in luck?"},{"question":"Do you play video games?"},{"question":"Do you believe people are inherently good?"},{"question":"How often do you shower?"},{"question":"What is your favorite board game?"},{"question":"What is your favorite charity?"},{"question":"Have you ever gotten a speeding ticket?"},{"question":"Do you prefer cats or dogs?"},{"question":"Would you prefer to live in the city or a rural area?"},{"question":"What is your favorite season?"},{"question":"Do you speak any other languages?"},{"question":"Have you ever cried because you were so happy?"},{"question":"What is the best thing that happened to you during the past week?"},{"question":"What is the worst thing that happened to you during the past week?"},{"question":"Do you sing in the shower?"},{"question":"What is the most valuable thing that you own?"},{"question":"What would you do if you only had 24 hours left to live?"},{"question":"What is something you've never done but would like to try to do?"},{"question":"What is something you've tried but would never do again?"},{"question":"Are you a hoarder or saver?"},{"question":"Are you usually early, late, or on time?"},{"question":"What is your best skill/talent?"},{"question":"What do you like least about living in your city/town?"},{"question":"What do you like most about living in your city/town?"},{"question":"Do you usually break the rules or follow them?"},{"question":"Are you a leader or a follower?"},{"question":"Do you wake up by yourself, to an alarm, music, or have someone else wake you up?"},{"question":"Are you more of a spontaneous or structured person?"},{"question":"How would your friends and family describe you?"},{"question":"How have your goals changed as you've gotten older?"},{"question":"Describe your dream house to me."},{"question":"What's the best thing to do on a hot summer day?"},{"question":"What's the best thing to do on a cold winter day?"},{"question":"What is your favorite smell?"},{"question":"Do you prefer to receive money or an actual gift?"},{"question":"What is your favorite day of the year?"},{"question":"Are you messy or organized?"},{"question":"Are you a heavy or a light sleeper?"},{"question":"Do you smile for pictures?"},{"question":"Do you wear slippers at home?"},{"question":"Do you remember the last dream you had?"},{"question":"How have you changed since you were a kid?"},{"question":"Do you untie your sneakers before taking them off?"},{"question":"What is your morning routine like?"},{"question":"What is your evening routine like?"},{"question":"What is the first thing that you think of in the morning?"},{"question":"What is the last thing that you think of before you go to sleep?"},{"question":"If you knew you couldn't fail, what would you do?"},{"question":"If you could go back in time and change one thing, what would that be?"},{"question":"If you could invent a holiday, what would it be?"},{"question":"If there was an extra hour every day, what would you do with it?"},{"question":"If you had to give up one of your five senses, which one would it be and why?"},{"question":"What would you do if you won the lottery?"},{"question":"If you became president, what is the first thing you would do?"},{"question":"What would you do if you couldn't use the internet or watch TV for a month?"},{"question":"If you could try out any job for one week, what job would you choose to try?"},{"question":"If you were the opposite gender for one day, what would you do?"},{"question":"If you could eliminate one thing that you did everyday, what would it be?"},{"question":"If you could spend one hour with any living person, who would it be and what would you choose to do?"},{"question":"Did you have any nicknames growing up?"},{"question":"What is the worst injury you've had."},{"question":"What jobs have you worked at?"},{"question":"What is the latest you stayed up until this past week?"},{"question":"What is the earliest you woke up this past week?"},{"question":"What are your favorite and least favorite parts of your week?"},{"question":"What did you learn in this past week?"},{"question":"What do you think your life will look like in 10 years?"},{"question":"What would you like to do when you retire?"},{"question":"What age do you want to live to?"},{"question":"After a long day, do you prefer to hang out with friends or spend time alone?"},{"question":"What is your favorite brand?"},{"question":"What do you like to do to celebrate your birthday?"},{"question":"What is your favorite thing to do on a rainy day?"},{"question":"What do you like to spend your money on?"},{"question":"Do you prefer to relax in your free time or do something active?"},{"question":"Do you shower in the morning or at night? Why?"},{"question":"What is your favorite party/board game?"},{"question":"Do you prefer to wear fashionable clothes or comfortable clothes?"},{"question":"What's your favorite comfort food?"},{"question":"Do you prefer to eat at home or eat out?"},{"question":"What food do you like to snack on?"},{"question":"What is your favorite dessert?"},{"question":"Do you prefer sweet or salty snacks?"},{"question":"If someone you were trying to impress was coming over to your home for dinner, what would you make for them?"},{"question":"What was your worst restaurant experience?"},{"question":"What's your favorite non-alcoholic drink?"},{"question":"How important is the decor of a restaurant to you?"},{"question":"What type of movies do you like to watch?"},{"question":"What do you use to listen to music?"},{"question":"Do you prefer to travel or stay close to home?"},{"question":"When going on a vacation, would you prefer to join a tour or plan out everything by yourself?"},{"question":"What's your favorite thing about going on vacation?"},{"question":"What's your least favorite thing about going on vacation?"},{"question":"Have you ever gone on vacation by yourself?"},{"question":"What do you like to do when you go to the beach?"},{"question":"Do you prefer to have many friends or just a few close ones?"},{"question":"Do you have a big family?"},{"question":"What is the first thing that you notice about someone of the opposite gender?"},{"question":"What do you look for in a girl/guy?"},{"question":"What qualities do you value most in a friend?"},{"question":"What is the first thing that you notice when meeting someone new?"},{"question":"What do you think the best invention is?"},{"question":"What is your favorite place to be?"},{"question":"Tell me your best advice?"},{"question":"If you could learn any skill, what would it be?"},{"question":"Do you believe in luck or do you believe that people make their own luck?"},{"question":"If money was not an issue, what would you do with your life?"},{"question":"Would you rather be really hairy or completely bald?"},{"question":"Would you rather be 4'5\" or 7'7\"?"},{"question":"Would you rather be blind or deaf?"},{"question":"Would you rather be tall and fat or short and well built?"},{"question":"Would you rather eat healthy or exercise regularly?"},{"question":"Would you rather be super strong or super fast?"},{"question":"Would you rather lose half your hair or lose half your hearing?"},{"question":"Would you rather look weak and actually be strong or look strong and actually be weak?"},{"question":"Would you rather have a third eye or a third arm?"},{"question":"Would you rather be as wide as you are tall, or as tall as you are wide?"},{"question":"Would you rather age from the neck up only or the neck down only?"},{"question":"Would you rather be poor and work at a job you love or be rich and work at a job you hate?"},{"question":"Would you rather be rich and ugly or poor and good looking?"},{"question":"Would you rather be rich or be poor and find true love?"},{"question":"Would you rather work really hard at an interesting job or slack off at a boring job?"},{"question":"Would you rather take a guaranteed $100,000 or a 50/50 chance at $1,000,000?"},{"question":"Would you rather be in constant pain or have a constant itch?"},{"question":"Would you rather be blind or not be able to talk for the rest of your life?"},{"question":"Would you rather go through life unable to answer any questions or unable to ask any questions?"},{"question":"Would you rather have no sense of smell or smell everything near you as though it were right in front of your nose?"},{"question":"Would you rather only be able to whisper or only be able to shout everything?"},{"question":"Would you rather save the life of someone that you're close to or save the lives of 5 random strangers?"},{"question":"Would you rather never touch another human again or never touch a computer powered device again?"},{"question":"Would you rather be the first to die among your close friends or be the last one to die?"},{"question":"Would you rather have a lousy short term memory or a terrible long term memory?"},{"question":"Would you rather have 1 wish granted today or 3 wishes granted 5 years from now?"},{"question":"Would you rather be homeless or live without family and friends?"},{"question":"Would you rather go without the internet or a car for a month?"},{"question":"Would you rather have to sit all day or stand all day?"},{"question":"Would you rather go to jail for a year or live in your car for a year?"},{"question":"Would you rather not be able to use your hands or not be able to walk?"},{"question":"Would you rather be a parent or a child?"},{"question":"Would you rather dump someone else or be the person getting dumped?"},{"question":"Would you rather be stuck in a house with someone you hate or be stuck in a house alone?"},{"question":"Would you rather be a genius in a world of morons, or a moron in a world of geniuses?"},{"question":"Would you rather be ugly and marry a good looking person or be good looking and marry an ugly person?"},{"question":"Would you rather take an ice cold shower and be clean or not shower at all?"},{"question":"Would you rather lick someone else's armpit or have someone else lick your armpit?"},{"question":"Would you rather eat a stick of butter or snort a tablespoon of salt?"},{"question":"Would you rather smell your own fart or smell someone elses?"},{"question":"Would you rather be a chronic farter or a chronic burper?"},{"question":"Would you rather drink a cup of spoiled milk or pee your pants in public?"},{"question":"Would you rather have the ability to fly or the ability to read people's mind?"},{"question":"Would you rather have your flight delayed by 8 hours or lose your luggage?"},{"question":"Would you rather be the worst player on the best team or the best player on a great team?"},{"question":"Would you rather never be able to eat hot food again or never take a hot shower again?"},{"question":"Would you rather be ignorant and happy or be knowledgeable and never fully content?"},{"question":"Would you rather never play or play but always lose?"},{"question":"Would you rather hang with a few friends or go to big party?"},{"question":"Would you rather be 10 minutes late or be 20 minutes early for everything?"},{"question":"Would you rather give out bad advice or receive bad advice?"},{"question":"Would you rather be a master of every musical instrument or be fluent in every language?"},{"question":"Would you rather be stuck in a home that is constantly dark or a house that is constantly bright?"},{"question":"Would you rather be a vegetarian or only be able to eat meat?"},{"question":"Would you rather be in your pajamas all day or in a suit all day?"},{"question":"Would you rather go forward or back in time?"}]